In [2]:
import pandas as pd

In [4]:
data = {
'2021' : [1116, 12259, 16699, 65119],
'2020' : [628, 11075, 15695, 56013],
'2019' : [678,12700,15148,55443],
'2018' : [712, 13597, 16052, 56024],
'면적순위' : [4,3,2,1]
}
columns = ['농지면적순위', '2021', '2020', '2019', '2018']
index = ['서울','부산','대구','인천']
df = pd.DataFrame(data, index=index, columns=columns)
df

   농지면적순위   2021   2020   2019   2018
서울    NaN   1116    628    678    712
부산    NaN  12259  11075  12700  13597
대구    NaN  16699  15695  15148  16052
인천    NaN  65119  56013  55443  56024

In [5]:
df.columns

Index(['농지면적순위', '2021', '2020', '2019', '2018'], dtype='object')

In [6]:
df.index

Index(['서울', '부산', '대구', '인천'], dtype='object')

In [7]:
df.index.name = '지역'

In [8]:
df

   농지면적순위   2021   2020   2019   2018
지역
서울    NaN   1116    628    678    712
부산    NaN  12259  11075  12700  13597
대구    NaN  16699  15695  15148  16052
인천    NaN  65119  56013  55443  56024

In [9]:
df.columns.name = '특성'

In [10]:
df

특성 농지면적순위   2021   2020   2019   2018
지역
서울    NaN   1116    628    678    712
부산    NaN  12259  11075  12700  13597
대구    NaN  16699  15695  15148  16052
인천    NaN  65119  56013  55443  56024

In [11]:
pd.Series([1,2,3,4,'s'])

0    1
1    2
2    3
3    4
4    s
dtype: object

In [12]:
df['2018-2021 변화율'] = ((df['2021'] - df['2018'])/ df['2018'] * 100)

In [25]:
df = df[['2018','2019','2020','2021','농지면적순위','2018-2021 변화율'].astype=(int)]

SyntaxError: invalid syntax (660188642.py, line 1)

In [16]:
df

특성   2018   2019   2020   2021 농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116    NaN      56.741573
부산  13597  12700  11075  12259    NaN      -9.840406
대구  16052  15148  15695  16699    NaN       4.030650
인천  56024  55443  56013  65119    NaN      16.234114

In [17]:
df.T

지역                    서울        부산       대구         인천
특성
2018                 712     13597    16052      56024
2019                 678     12700    15148      55443
2020                 628     11075    15695      56013
2021                1116     12259    16699      65119
농지면적순위               NaN       NaN      NaN        NaN
2018-2021 변화율  56.741573 -9.840406  4.03065  16.234114

In [ ]:
df['2018-2021 변화율'] =

In [20]:
df['2018']['서울']

712

In [21]:
temp = pd.Series(['a','b','c','d','e'])

In [22]:
temp[0]

'a'

In [23]:
print(df['2021']['서울'])
print(df['2021'][0])

1116
1116

In [26]:
df.sort_values(by='2018-2021 변화율')

특성   2018   2019   2020   2021 농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259    NaN      -9.840406
대구  16052  15148  15695  16699    NaN       4.030650
인천  56024  55443  56013  65119    NaN      16.234114
서울    712    678    628   1116    NaN      56.741573

In [27]:
temp_list = [1,2,3,4]
temp_list[:2]

[1, 2]

In [28]:
df[:2]

특성   2018   2019   2020   2021 농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116    NaN      56.741573
부산  13597  12700  11075  12259    NaN      -9.840406

In [29]:
# loc : 행,열의 이름을 통해
#iloc : 정수 인자를 통해 
df.loc[['부산']]

특성   2018   2019   2020   2021 농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259    NaN      -9.840406

In [31]:
df.iloc[0,0]

712

In [32]:
df['2018']['서울']

712

In [33]:
df.iloc[0][0]

712

In [35]:
#실습
index = ['철수', '영희', '길동', '슬기']
columns = ['국어', '영어', '수학', '과학']
data = {
    '국어' : [80,90,70,30],
    '영어' : [90,50,60,50],
    '수학' : [70,100,50,70],
    '과학' : [30,50,80,80]
}
df = pd.DataFrame(data, index=index, columns=columns)

In [36]:
df

    국어  영어   수학  과학
철수  80  90   70  30
영희  90  50  100  50
길동  70  60   50  80
슬기  30  50   70  80

In [37]:
df['평균'] = df.mean(axis=1)

In [40]:
df.loc['평균'] = df.mean()

In [41]:
df

      국어    영어     수학    과학      평균
철수  80.0  90.0   70.0  30.0  67.500
영희  90.0  50.0  100.0  50.0  72.500
길동  70.0  60.0   50.0  80.0  65.000
슬기  30.0  50.0   70.0  80.0  57.500
평균  67.5  62.5   72.5  60.0  65.625